Revit 2027 API
IFCAnyHandle.GetAttribute Method
 Gets the attribute by name.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCData GetAttribute(
	string name
)
Public Function GetAttribute (
	name As String
) As IFCData
public:
IFCData^ GetAttribute(
	String^ name
)
member GetAttribute :
        name : string -> IFCData
Parameters
name String
 The name.
Return Value
IFCData
 The value.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace